# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import random as rd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [15]:
data1, data2, data3 = [],[],[]
for i in range(0,100):
    data1.append(rd.randint(1,4))
    data2.append(rd.randint(1,3))
    data3.append(rd.randint(10000,30000))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [16]:
data = pd.DataFrame(dict(data1=data1, data2=data2, data3=data3))
data.sample(10)

    data1  data2  data3
61      2      1  20823
74      1      3  11772
13      1      2  24949
27      3      2  24387
69      2      1  20208
97      2      3  29199
9       2      3  27622
65      4      2  26596
2       4      2  16366
45      4      3  26513

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [18]:
data.columns = ["bedrs","bathrs","price_sqr_meter"]
data.head()

   bedrs  bathrs  price_sqr_meter
0      1       1            16949
1      4       3            21325
2      4       2            16366
3      2       2            10472
4      2       3            28164

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [26]:
data.info()
data["bigcolumns"] = data.bedrs.astype(str)+","+data.bathrs.astype(str)+","+data.price_sqr_meter.astype(str)
data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
bedrs              100 non-null int64
bathrs             100 non-null int64
price_sqr_meter    100 non-null int64
bigcolumns         100 non-null object
dtypes: int64(3), object(1)
memory usage: 3.2+ KB

   bedrs  bathrs  price_sqr_meter bigcolumns
0      1       1            16949  1,1,16949
1      4       3            21325  4,3,21325
2      4       2            16366  4,2,16366
3      2       2            10472  2,2,10472
4      2       3            28164  2,3,28164

### Step 6. Ops it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299